advanced/frontend/controllers/RegisterController.php

    public function actionAdd_do(){
        $model = new Register();
        $data = Yii::$app->request->post();
        $model->tel = $data['tel'];
        $model->password = $data['password'];
        $model->repassword = $data['repassword'];
        $id = $model->save();
---
INSERT INTO `register` (`tel`, `password`, `repassword`) VALUES ('15210875411', '123', '123')

    public function actionDo(){
        $model = new Register();
        $data = Yii::$app->request->post();
        $model->name = $data['name'];
        $model->sr = $data['sr'];
        $model->address = $data['address'];
        $id = $model->save();
---
INSERT INTO `register` (`name`, `sr`, `address`) VALUES ('', '', '')

    public function actionNext(){
        $model = new Register();
        Yii::$app->request->post();
        $model->save();
---
INSERT INTO `register` (`id`) VALUES (DEFAULT)